Repository: Shreddingercat/Angel_Bot
Catalog: locale/*/LC_MESSAGES/Translate.po
Languages: ru_ru

source: Hello! This is a telegram bot of the Search And Rescue Squad "Angel". Search And Rescue Squad "Angel" is the first voluntary movement in the Republic of Belarus to assist in the search for missing people. How can we help you? Choose from the options provided. If you haven't found your option, just write to us. We will definitely answer
ru_ru: Здравствуйте! Это telegram-бот поисково-спасательного отряда "Ангел". Поисково-спасательный отряд "Ангел" - первое в Республике Беларусь добровольное движение по оказанию помощи в поиске без вести пропавших людей. Чем мы можем Вам помочь? Выберите из предложенных вариантов. Если Вы не нашли свой вариант, то просто напишите нам. Мы обязательно ответим

source: If a person is missing, the first step is to call the Accident Registration Bureau (see phone numbers below). All information flows here every day from the duty units, sobering-up centers, hospitals and morgues, and is entered into a single database. It contains information about persons detained by the internal affairs bodies and persons taken to medical institutions who are unable to provide information about themselves, as well as information about the discovery of unknown corpses. You need to tell the operator in detail about what happened. There you will be given information about all accidents and accidents that have occurred over the past day. The fact of possible hospitalization of the missing person by the ambulance service should be checked.
ru_ru: Если пропал человек, в первую очередь следует позвонить в Бюро регистрации несчастных случаев (номера телефонов смотреть ниже). Вся информация ежесуточно стекает сюда из дежурных частей ОВД, вытрезвителей, больниц и моргов, и заносится в единую базу данных. Здесь находятся сведения о лицах, задержанных органами внутренних дел, и лицах, доставленных в медицинские учреждения, не имеющих возможности сообщить о себе сведения, а также и информация об обнаружении неизвестных трупов. Вам необходимо подробно рассказать оператору о произошедшем. Там Вам дадут информацию о всех несчастных случаях и ДТП, произошедших за минувшие сутки. Следует проверить факт возможной госпитализации пропавшего человека службой скорой помощи.

source: Call any of the numbers listed in the orientation.
ru_ru: Позвоните по любому из номеров, указанных в ориентировке.

source: You can personally help in finding the missing person by: - disseminating information on the Internet; - pasting orientation and interviewing passers-by; - departure for urban and forest searches; - and others. Each person, regardless of which city he is in, can provide significant assistance. Everyone is dear to us!
ru_ru: Лично Вы можете помочь в поиске пропавшего: - распространением информации в интернете; - расклейкой ориентировок и опросом прохожих; - выездом на городские и лесные поиски; - и другим. Каждый человек независимо от того, в каком городе он находится, может оказать существенную помощь. Нам дорог каждый!

source: How can you support the "Angel"? With the help of donations! ☎ USSD request for MTS subscribers, A1 and life:) - *222*13#! 💳 by transfer from a bank card (there is also a subscription to monthly transfers) https://imenamag.by/projects/26988691 📥 Electronic payments (ERIP) service code 4345671 ☎ replenishment of detachment mobile phones +375(33)6666-856, +375(33)6666-033
ru_ru: Как можно поддержать ПСО "Ангел"? С помощью пожертвований! ☎ USSD-запрос для абонентов МТС, А1 и life:) - *222*13#! 💳 переводом с банковской карточки (есть также и подписка на ежемесячные перечисления) https://imenamag.by/projects/26988691 📥 Электронные платежи (ЕРИП) код услуги 4345671 ☎ пополнение отрядных моб.телефонов +375(33)6666-856, +375(33)6666-033

source: The person is missing
ru_ru: Потерялся человек

source: The person is found
ru_ru: Найден человек

source: I want to become a volunteer
ru_ru: Стать волонтером

source: Donate
ru_ru: Оказать материальную помощь

source: Your message has been accepted. We will contact you as soon as possible
ru_ru: Ваше сообщение принято. Мы свяжемся с Вами в ближайшее время
