# -*- coding: utf8 -*

welcome = 'Здравствуйте! Это telegram-бот поисково-спасательного отряда "Ангел". Поисково-спасательный отряд ' \
            '«Ангел» - первое в Республике Беларусь добровольное движение по оказанию помощи в поиске без ' \
            'вести пропавших людей. Чем мы можем Вам помочь?'
missing = 'Если пропал человек, в первую очередь следует позвонить в Бюро регистрации несчастных случаев ' \
            '(БРНС) (номера телефонов смотреть ниже). Вся информация ежесуточно стекает сюда из дежурных ' \
            'частей ОВД, вытрезвителей, больниц и моргов, и заносится в единую базу данных. Здесь ' \
            'находятся сведения о лицах, задержанных органами внутренних дел, и лицах, доставленных в ' \
            'медицинские учреждения, не имеющих возможности сообщить о себе сведения, а также и информация ' \
            'об обнаружении неизвестных трупов. Вам необходимо подробно рассказать оператору о произошедшем' \
            '. Там Вам дадут информацию о всех несчастных случаях и ДТП, произошедших за минувшие сутки. ' \
            'Следует проверить факт возможной госпитализации пропавшего человека службой скорой помощи.'
found = 'Позвоните по любому из номеров, указанных в ориентировке.'
volunteer = 'Лично Вы можете помочь в поиске пропавшего:\n- распространением информации в интернете;\n' \
            '- расклейкой ориентировок и опросом прохожих;\n- выездом на городские и лесные поиски;\n' \
            '- и другим (доп. информация на стене группы).\n\nКаждый человек независимо от того, в каком ' \
            'городе он находится, может оказать существенную помощь. Нам дорог каждый!'
donate = 'Как можно поддержать ПСО "Ангел"?\nС помощью пожертвований!\n\n☎ USSD-запрос для абонентов МТС' \
            ', А1 и life:) - *222*13#!\n💳 переводом с банковской карточки (есть также и подписка на ' \
            'ежемесячные перечисления) https://imenamag.by/projects/26988691\n📥 Электронные платежи ' \
            '(ЕРИП) код услуги 4345671\n☎ пополнение отрядных моб.телефонов 8 (033) 6666-856, 8 (033) ' \
            '6666-033'